Repository: MohamedShiha/DermaHelp
Catalog: DermaHelp/*.lproj/Localizable.strings
Languages: ar

source: Sign up
ar: إنشاء حساب

source: Login
ar: تسجيل دخول

# feature1
source: Scan and assess
ar: افحص و قيم

# feature2
source: Save medical records
ar: احفظ سجلات الطبيه

# feature3
source: Connect with doctors
ar: تواصل مع الأطباء

# welcome
source: Welcome Back
ar: نرحب بعودتك

# welcome status
source: We have been waiting for you
ar: لقد كنا بانتظارك

source: Email Address
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: show
ar: إظهار

source: hide
ar: إخفاء

# forgot?
source: Forgot password?
ar: نسيت كلمة المرور؟

# not member?
source: Not a member?
ar: لست عضوا؟

source: Join Us
ar: إنضم إلينا

# joining purpose
source: For a Skin Cancer-Free World
ar: من أجل عالم خالي من السرطان

source: New password
ar: كلمة المرور الجديدة

source: Confirm password
ar: تأكيد كلمة المرور

# terms
source: By signing up, you agree to our Terms and Conditions
ar: .بإنشائك حساب، انت توافق على الشروط و الأحكام

# member?
source: Already a member?
ar: لديك حساب بالفعل؟

source: Assessments
ar: التقييمات

source: My Assessments
ar: تقييماتي

# empty assessment
source: No Assessment Found
ar: لا يوجد تقييمات

# empty assessment hint
source: Tap the + button to add an assessment.
ar: اضغط على زر + لإضافة تقييم جديد.

source: Risk
ar: الخطورة

source: Severity
ar: الحدة

source: low
ar: منخفض

source: low medium
ar: اقل من متوسط

source: medium
ar: متوسط

source: high medium
ar: اكثر من متوسط

source: hazardous
ar: خطير

# info heading
source: More information
ar: معلومات أكثر

# Basal cell carcinoma heading
source: Basal Cell Carcinoma
ar: سرطان الخلایا القاعدیة

# Basal cell carcinoma awareness
source: - Basal cell carcinoma is mostly a benign form of skin cancer. - Therapies that are currently used for basal cell carcinoma offer an 85 to 95 percent recurrence-free cure rate. - Most are curable and cause minimal damage when caught and treated early.
ar: - سرطان الخلایا القاعدیة ھو في الغالب شكل حمید من سرطان الجلد. - العلاجات المستخدمة حالیا لسرطان الخلایا القاعدیة تقدم معدل علاج خالي من التكرار بنسبة 85 إلى %95. - معظم الحالات قابلة للشفاء، وتقل الأضرار عند تشخیصھا ومعالجتھا مبكرا.

# Benign keratosis-like lesion heading
source: Benign Keratosis-Like Lesions
ar: التقرن الحمید

# Benign keratosis-like lesion awareness
source: - Benign keratosis (also called seborrheic keratosis) are noncancerous (benign) skin growths. - Following the first treatment, complete healing was detected in 68-100% of the lesions. - Seborrheic keratosis can be unsightly, but the growths aren't harmful.
ar: - التقرن الحمید )یسمى أی ًضا التقرن الدھني( ھي أورام جلدیة غیر سرطانیة (حمیدة). - تم الشفاء التام بعد العلاج الأول في ٦٨-١٠٠٪ من الآفات. - یمكن أن یبدو التقرن الدھني قبیحا، ولكن نموه لیس ضارا.

# Dermatofibroma heading
source: Dermatofibroma
ar: ورم لیفي جلدي

# Dermatofibroma awareness
source: - Dermatofibromas are noncancerous (benign) skin growths that can develop anywhere on the body but most often appear on the lower legs, upper arms or upper back. - As they are harmless and do not turn into cancer, no treatment is usually needed. - Dermatofibromas do not go away by themselves, but they can be removed under local anaesthetic if there is doubt about their diagnosis.
ar: - الأورام اللیفیة الجلدیة ھي أورام جلدیة حمیدة یمكن أن تتطور في أي مكان في الجسم؛ ولكنھا تظھر في الغالب أسفل الساقین أو أعلى الذراعین أو أعلى الظھر. - حیث أنھا غیر ضارة ولا تتحول إلى سرطان، لا یلزم العلاج عادة. - الأورام اللیفیة الجلدیة لا تزول من تلقاء نفسھا، ولكن یمكن إزالتھا تحت التخدیر الموضعي إذا كان ھناك شكوك حول تشخیصھا.

# Melanocytic nevus heading
source: Melanocytic Nevus
ar: وحمة صباغیة

# Melanocytic nevus awareness
source: - If diagnosed properly, melanocytic nevi are biologically stable, completely benign lesions. -Patients with multiple melanocytic nevi or sizable ones appear to have an increased lifetime risk of melanoma. - Melanocytic nevi can be surgically removed for cosmetic considerations or because of concern regarding the potential of melanoma.
ar: - إذا تم تشخيصها بشكل صحيح، فإن الوحمات الصباغية تكون مستقرة بيولوجيًا، وحميدة تمامًا. - المرضى الذين يعانون من وحمات صباغية متعددة أو كبيرة يكونون أكثر عرضة لخطر الإصابة بسرطان الجلد الخبيث. - يمكن إزالة الوحمات الصباغية جراحيا لأسباب تجميلية أو بسبب القلق بشأن احتمالية الإصابة بسرطان الجلد الخبيث.

# Melanoma heading
source: Melanoma
ar: سرطان الجلد الميلاني

# Melanoma awareness
source: - Melanoma is the most dangerous type of skin cancer. It may appear as a new spot or as a change in an existing mole or freckle. - Over 95 per cent of skin cancers can be successfully treated if they are found early. - Once melanoma has spread deeper into the skin or other parts of the body, it becomes more difficult to treat and can be deadly.
ar: - الورم الميلاني هو أخطر أنواع سرطان الجلد. قد يظهر على شكل بقعة جديدة أو كتغير في شامة أو نمش. - يمكن علاج أكثر من 95% من سرطانات الجلد الميلانية بنجاح إذا تم اكتشافها مبكرًا. - بمجرد انتشار الورم الميلاني في الجلد أو في أجزاء أخرى من الجسم، يصبح من الصعب علاجه ويمكن أن يكون مميتًا.

# Vascular lesion heading
source: Vascular Lesions
ar: ورم الأوعية الدموية

# Vascular lesion awareness
source: - Vascular tumors may be benign (not cancer) or malignant (cancer) and can occur anywhere in the body. - For example, angioma is a benign tumor made up of blood vessels, whereas angiosarcoma is a cancerous growth of the same cells, but is malignant. - Infantile hemangiomas are the most common type of vascular lesion, They are benign tumors of the cells that line blood vessels.
ar: - قد تكون أورام الأوعية الدموية حميدة أو خبيثة (سرطانية) ويمكن أن تحدث في أي مكان في الجسم. - على سبيل المثال، الورم الوعائي هو ورم حميد يتكون في الأوعية الدموية، في حين أن الساركوما الوعائية هي نمو سرطاني مكون من الخلايا نفسها ، ولكنها خبيثة. - الأورام الوعائية غير السرطانية هي أكثر أنواع الآفات الوعائية شيوعًا، وهي أورام حميدة في الخلايا التي تبطن الأوعية الدموية.

source: Begin Assessment
ar: بدء التقييم

source: How it works
ar: كيف يعمل التطبيق

# manual
source: DermaHelp analyses your captured photos in a highly intelligent way to provide you with accurate results, raises your awareness, and shows you the nearest dermatologist on the map.
ar: التطبيق يحلل الصورة التي تلتقطها بطريقه ذكية جدا لإمدادك بنتائج دقيقة و زيادة توعيتك حول السرطان و أيضا يساعدكم في ايجاد اقرب أخصائي أمراض جلدية على الخريطة.

source: Take Photo
ar: إلتقط صورة

# choose photo
source: Photo Library
ar: البوم الصور

source: Me
ar: أنا

source: Change photo
ar: تغيير الصورة

source: MY ACCOUNT
ar: حسابي

source: Name
ar: الإسم

source: Gender
ar: النوع

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Birthday
ar: تاريخ الميلاد

source: ACCOUNT ACTIONS
ar: اجراءات الحساب

# clear assessments
source: Clear my assessments
ar: امسح تقييماتي

source: Log out
ar: تسجيل الخروج

source: SAVE
ar: حفظ

# name hint
source: This is how you appear on DermaHelp. This name is private and will not be shared among other users neither used in medical analysis.
ar: هكذا تظهر على DermaHelp. هذا الاسم خاص بك و ليس لأحد أولوية أن يراه ولن يتم استخدامه في أي من تقييماتك.

# gender hint
source: This is just something related to you profile to identify you and will be used for analysis purpose.
ar: هذا شيئ مرتبط فقط بملف الشخصي وسوف يتم استخدامه من أجل عمل احصائات شاملة.

# birthday hint
source: Your birthdate affects the general analysis results.
ar: يؤثر تاريخ ميلادك بشكل غير مباشر على الإحصائات العامة.

# email hint
source: This make it easier for you to recover your account, and more.
ar: هكذا يكون من الأسهل لك استرجاع حسابك و أكثر من ذلك.

source: CONTINUE
ar: متابعه

# auth hint
source: For your security, please enter your password.
ar: من أجل أمانك، أدخل كلمة مرورك.

source: CONFIRM
ar: تأكيد

# password auth hint
source: To set a new password, please enter your current password first.
ar: لتغيير كلمة المرور، أدخل كلمة المرور الحالية.

# password hint
source: Please choose a new password. DermaHelp uses strong password rules to ensure that your data and personal information are secure.
ar: أدخل كلمة المرور الجديدة. DermaHelp يستخدم شروط قوية لضمان سرية معلوماتك الشخصية.

# password rule
source: Your password should:
ar: كلمة المرور يجب أن:

# count rule
source: - range between 8 and 24 characters.
ar: - تتراوح ما بين ٨ إلى ٢٤ حرف.

# uppercase rule
source: - contain 1 uppercase letter at least.
ar: - تحتوي على حرف كبير على الأقل.

# digit rule
source: - contain 1 number at least.
ar: - تحتوي على رقم على الأقل.

# no blacklisted rule
source: - not contain whitespaces or special characters.
ar: - لا تحتوي على مسافات أو حروف خاصة.

# more info
source: More Information
ar: المزيد من المعلومات

source: Share
ar: مشاركة

source: Delete
ar: مسح

source: Cancel
ar: إلغاء

source: Try Again
ar: حاول مجددا

source: Okay
ar: حسنا

source: Oops!
ar: عذرا!

# empty assessment alert
source: You have not conducted any assessments yet.
ar: لا يوجد لديك أي تقييمات حتى الآن.

# verify clearing assessments
source: Are you sure you want to clear all you assessments?
ar: هل أنت متأكد أنك تريد مسح تقييماتك؟

# verify clearing message
source: Assessments will be removed from your profile but they will be kept for analysis purpose. This action can not be undone.
ar: سوف يتم مسح التقييمات المرتبطة بحسابك ولكن سيتم إبقاؤها من أجل عمل إحصاىيات. لا يمكنك التراجع في هذا القرار.

# verify clearing an assessment
source: Are you sure you want to delete this assessment?
ar: هل أنت متأكد أنك تريد مسح هذا التقييم

# verify clearing an assessment message
source: This action can not be undone.
ar: لا يمكنك التراجع في هذا القرار.

# verify log out
source: Are you sure you want to log out?
ar: هل تريد تسجيل الخروج من حسابك

# invalid password
source: The password you entered is invalid.
ar: كلمة المرور التي أدخلتها غير مطابقة للشروط.

# successful update
source: Your %1$@ has been updated successfully.
ar: تم تحديث %1$@ بنجاح.

# invalid email
source: The email you entered is invalid.
ar: البريد الإلكتروني الذي آدخلته غير مناسب.

# password mismatch
source: Passwords do not match.
ar: كلمات المرور غير متطابقة.

# invalid password rules
source: Your password does not match the specified rules.
ar: كلمة المرور لا تستوفي الشروط.

# credentials alert
source: Enter your credentials to login.
ar: أدخل المعلومات السرية لتسجيل الدخول.

# password rules list
source: The password you entered does not match our security rules. Your password should: range between 8 and 24 characters. contain 1 uppercase letter at least. contain 1 number at least. not contain whitespaces or special characters.
ar: كلمة المرور التي أدخلتها لا تستوفي الشروط. كلمة المرور يجب أن: تتراوح ما بين ٨ إلى ٢٤ حرف. تحتوي على حرف كبير على الأقل. تحتوي على رقم على الأقل. لا تحتوي على مسافات أو حروف خاصة.

# analyzing error
source: Unable to analyze the image.
ar: حدث خطأ في تحليل الصورة.

# deleting error
source: Unable to delete the assessment.
ar: حدث خطأ أثناء مسح التقييم.

source: Camera Roll
ar: ألبوم الصور

# no camera error
source: This device currently does not support taking photos with a camera.
ar: عفوا، هذا الجهاز لا يدعم إلتقاط صور بالكاميرا حاليا.

source: Settings
ar: الإعدادات

# library source
source: photo library or videos
ar: مكتبة الصور أو الفيديوهات

# camera and photo access error
source: %1$@ does not have access to your %2$@, tap Settings and turn on photos and camera access.
ar: %1$@ ليس لديه إمكانية الدخول على %2$@, إذهب إلى الإعدادات ومكن التطبيق من استخدام الكاميرا و مكتبة الصور
